Arharim/STM32_LSM6DSO/src/MAIN.c
#include <stdio.h>
#include <stdbool.h>
#include "stm32f10x.h"
#include "utils.h"

// SPI Chip Select Pin (PA4)
#define CS_PIN_HIGH()   (GPIOA->BSRR = BIT(4U))
#define CS_PIN_LOW()    (GPIOA->BSRR = (BIT(4U) << 16U))

#define LSM6DSO_STABILIZATION_MS  (100U)
#define LSM6DSO_RETRY_DELAY_MS    (10U)
#define UART_TX_BUFFER_SIZE       (256U)
#define SPI_BURST_READ_LEN        (6U)
#define MAX_INIT_RETRIES          (3U)
#define FORMAT_BUFFER_SIZE        (64U)
#define GPIO_SPEED_2MHZ           (2U)
#define SPI_DUMMY_BYTE            (0xFFU)
#define UART_DUMMY_BYTE           (0x00U)
#define DELAY_LOOP_COUNT          (10U)
#define TIMEOUT_ZERO              (0U)
#define ARRAY_INDEX_ZERO          (0U)
#define ARRAY_INDEX_ONE           (1U)
#define ARRAY_INDEX_TWO           (2U)
#define ARRAY_INDEX_THREE         (3U)
#define ARRAY_INDEX_FOUR          (4U)
#define ARRAY_INDEX_FIVE          (5U)
#define SHIFT_8_BITS              (8U)
#define SHIFT_16_BITS             (16U)

// Error Codes
typedef enum
{
    ERROR_NONE = 0,
    ERROR_SPI_TIMEOUT = -1,
    ERROR_INVALID_PARAM = -2,
    ERROR_INIT_FAILED = -3,
    ERROR_CHIP_ID_MISMATCH = -4
} ErrorCode_t;

// FSM States
typedef enum
{
   STATE_INIT,        // Init hardware and gyroscope
   STATE_STABILIZING, // New state for non-blocking delay
   STATE_READ,        // Read sensor data
   STATE_PROCESS,     // Process data into str
   STATE_OUTPUT,      // Output data via UART
   STATE_IDLE,        // Wait for timer interrupt
   STATE_ERROR        // Error state for recovery or halt
} State_t;

typedef struct
{
    volatile State_t current_state;
    volatile s16 gyro_x;
    volatile s16 gyro_y; 
    volatile s16 gyro_z;
    u8 retry_count;
    u32 stabilization_start_time;
    u32 last_retry_time;
    volatile u32 system_tick;
} SystemState_t;

typedef struct
{
    volatile char buffer[UART_TX_BUFFER_SIZE];
    volatile u16 write_idx;
    volatile u16 read_idx;
} UartBuffer_t;

// Global instances - organized and minimal
static SystemState_t g_system = {STATE_INIT, 0, 0, 0, 0U, 0U, 0U, 0U};
static UartBuffer_t g_uart_tx = {{0}, 0U, 0U};

// Static buffers to avoid stack allocation in frequently called functions
static char g_format_buffer[FORMAT_BUFFER_SIZE];   // For snprintf operations
static u8 g_spi_buffer[SPI_BURST_READ_LEN];        // For SPI burst reads

static ErrorCode_t read_gyro_data(void);
static void set_state(State_t new_state);static ErrorCode_t read_gyro_data(void);
static void set_state(State_t new_state);
static void handle_init_state(void);
static void handle_stabilizing_state(void);
static void handle_read_state(void);
static void handle_process_state(void);
static void handle_output_state(void);
static void handle_error_state(void);
static void clear_spi_rx_buffer(void);
static bool is_uart_enabled(void);
static bool is_timer_running(u32 timer_base);

void SysTick_Handler(void)
{
    g_system.system_tick++;
}

u32 get_system_tick(void)
{
    u32 tick_value;
    __disable_irq();
    tick_value = g_system.system_tick;
    __enable_irq();
    return tick_value;
}

void TIM2_IRQHandler(void)
{
   if ((TIM2->SR & TIM_SR_UIF) != 0U) 
   {
       TIM2->SR &= ~TIM_SR_UIF;
       if (g_system.current_state == STATE_IDLE) 
       {
           g_system.current_state = STATE_READ;
       }
   }
}

// UART Interrupt Service Routine
void USART1_IRQHandler(void)
{
    const u32 sr = USART1->SR;
    
    if (((USART1->CR1 & USART_CR1_TXEIE) != 0U) && ((sr & USART_SR_TXE) != 0U)) {
        if (g_uart_tx.read_idx != g_uart_tx.write_idx) {
            USART1->DR = (u16)g_uart_tx.buffer[g_uart_tx.read_idx];
            g_uart_tx.read_idx = (g_uart_tx.read_idx + 1U) % UART_TX_BUFFER_SIZE;
        } else {
            USART1->CR1 &= ~USART_CR1_TXEIE;
        }
    }
    
    if ((sr & (USART_SR_ORE | USART_SR_NE | USART_SR_FE | USART_SR_PE)) != 0U) {
        const volatile u32 dummy = USART1->DR;
        (void)dummy;
        // Error counters could be incremented here
    }
    
    if ((sr & USART_SR_RXNE) != 0U) {
        const volatile u8 received_data = (u8)USART1->DR;
        (void)received_data; // Process received data here if needed
    }
}

static void clear_spi_rx_buffer(void)
{
    while ((SPI1->SR & SPI_SR_RXNE) != 0U) {
        const volatile u8 dummy = (u8)SPI1->DR;
        (void)dummy;
    }
}

static bool is_uart_enabled(void)
{
    return ((USART1->CR1 & USART_CR1_UE) != 0U);
}

static bool is_timer_running(const u32 timer_base)
{
    bool is_running = false;
    
    if (timer_base == (u32)TIM2) {
        is_running = ((TIM2->CR1 & TIM_CR1_CEN) != 0U);
    } else if (timer_base == (u32)TIM3) {
        is_running = ((TIM3->CR1 & TIM_CR1_CEN) != 0U);
    } else {
        // Invalid timer base
    }
    
    return is_running;
}

// Use static buffer to avoid stack allocation
static ErrorCode_t read_gyro_data(void)
{
    ErrorCode_t result = ERROR_NONE;
    
    if (spi_read_burst(LSM6DSO_OUTX_L_G, g_spi_buffer, SPI_BURST_READ_LEN) != 0) {
        result = ERROR_SPI_TIMEOUT;
    } else {
        g_system.gyro_x = (s16)(((s16)g_spi_buffer[ARRAY_INDEX_ONE] << SHIFT_8_BITS) | 
                                (s16)g_spi_buffer[ARRAY_INDEX_ZERO]);
        g_system.gyro_y = (s16)(((s16)g_spi_buffer[ARRAY_INDEX_THREE] << SHIFT_8_BITS) | 
                                (s16)g_spi_buffer[ARRAY_INDEX_TWO]);
        g_system.gyro_z = (s16)(((s16)g_spi_buffer[ARRAY_INDEX_FIVE] << SHIFT_8_BITS) | 
                                (s16)g_spi_buffer[ARRAY_INDEX_FOUR]);
    }
    
    return result;
}

// Helper function to change state safely
static void set_state(const State_t new_state)
{
    __disable_irq();
    g_system.current_state = new_state;
    __enable_irq();
}

static void handle_init_state(void) 
{
    g_system.retry_count = MAX_INIT_RETRIES;
    init_clocks();
    init_gpio();
    init_spi();
    init_uart();
    init_timer();

    // Configure LSM6DSO Gyroscope
    if ((spi_write(LSM6DSO_CTRL2_G, LSM6DSO_GYRO_208HZ_2000DPS) != 0) || 
        (spi_write(LSM6DSO_CTRL3_C, LSM6DSO_BDU_ENABLE)!= 0)) {
        set_state(STATE_ERROR);
        return;
    }

