Arharim/STM32_LSM6DSO/src/MAIN.c
    g_system.stabilization_start_time = get_system_tick();
    g_system.last_retry_time = get_system_tick();
    set_state(STATE_STABILIZING);
}

static void handle_stabilizing_state(void)
{
    const u32 current_tick = get_system_tick();
    
    if ((current_tick - g_system.stabilization_start_time) < LSM6DSO_STABILIZATION_MS) {
        return;
    }

    if ((g_system.retry_count > 0U) && 
        ((current_tick - g_system.last_retry_time) >= LSM6DSO_RETRY_DELAY_MS)) {
        
        u8 chip_id = 0U;
        if (spi_read(LSM6DSO_WHO_AM_I, &chip_id) != 0) {
            set_state(STATE_ERROR);
            return;
        }

        if (chip_id == LSM6DSO_EXPECTED_ID) {
            set_state(STATE_IDLE);
        } else {
            g_system.retry_count--;
            g_system.last_retry_time = current_tick;
            
            const int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer),
                    "ERR:ID 0x%02X, retries left: %u\r\n", 
                    (unsigned int)chip_id, (unsigned int)g_system.retry_count);
            
            if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
                uart_puts(g_format_buffer);
            }
            
            if (g_system.retry_count == 0U) {
                set_state(STATE_ERROR);
            }
        }
    }
}

static void handle_read_state(void)
{
    if (read_gyro_data() != ERROR_NONE) {
        set_state(STATE_ERROR);
    } else {
        set_state(STATE_PROCESS);
    }
}

static void handle_process_state(void)
{
    const int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
            "X:%6d Y:%6d Z:%6d\r\n", 
            (int)g_system.gyro_x, (int)g_system.gyro_y, (int)g_system.gyro_z);
    
    if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
        set_state(STATE_OUTPUT);
    } else {
        set_state(STATE_ERROR);
    }
}

static void handle_output_state(void)
{
    uart_puts(g_format_buffer);
    set_state(STATE_IDLE);
}

static void handle_error_state(void)
{
    uart_puts("System halted due to error\r\n");
    while (1) {
        __NOP();
    }
}

int main(void)
{
    g_system.current_state = STATE_INIT;
    
    while (1) 
    {
        switch (g_system.current_state) 
        {
            case STATE_INIT:        handle_init_state();        break;
            case STATE_STABILIZING: handle_stabilizing_state(); break;
            case STATE_READ:        handle_read_state();        break;
            case STATE_PROCESS:     handle_process_state();     break;
            case STATE_OUTPUT:      handle_output_state();      break;
            case STATE_IDLE:        __WFI();                    break;
            case STATE_ERROR:       handle_error_state();       break;
            default:
                set_state(STATE_ERROR);
                break;
        }
    }
}

// Initialize peripheral clocks
void init_clocks(void)
{
    RCC->CR |= RCC_CR_HSION;
    while((RCC->CR & RCC_CR_HSIRDY) == 0U) { /* Wait for HSI */ }

    RCC->CFGR = 0x00000000UL;
    RCC->CR &= ~(RCC_CR_HSEON | RCC_CR_CSSON | RCC_CR_PLLON);
    RCC->CR &= ~RCC_CR_HSEBYP;
    RCC->CIR = 0x00000000UL;    
    // RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL);
    // RCC->CIR = 0x009F0000; 

    RCC->CR |= RCC_CR_HSEON;
    u32 timeout = HSE_STARTUP_TIMEOUT;
    while (((RCC->CR & RCC_CR_HSERDY) == 0U) && (timeout > 0U)) {
        timeout--;
    }
    
    if ((RCC->CR & RCC_CR_HSERDY) == 0U) {
        set_state(STATE_ERROR); // HSE failed to start
        return;
    }

    FLASH->ACR |= FLASH_ACR_PRFTBE;
    FLASH->ACR &= ~FLASH_ACR_LATENCY;
    FLASH->ACR |= FLASH_ACR_LATENCY_0;

    RCC->CFGR &= ~(RCC_CFGR_PLLSRC | RCC_CFGR_PLLXTPRE | RCC_CFGR_PLLMULL);
    RCC->CFGR |= RCC_CFGR_PLLSRC;
    RCC->CFGR |= RCC_CFGR_PLLMULL3;   
 
    RCC->CR |= RCC_CR_PLLON;
    timeout = PLL_LOCK_TIMEOUT;
    while (((RCC->CR & RCC_CR_PLLRDY) == 0U) && (timeout > 0U)) {
        timeout--;
    }
    
    if ((RCC->CR & RCC_CR_PLLRDY) == 0U) {
        set_state(STATE_ERROR); // PLL failed to lock
        return;
    }

    // RCC->CFGR &= ~(RCC_CFGR_HPRE | RCC_CFGR_PPRE1 | RCC_CFGR_PPRE2);
    // RCC->CFGR |= RCC_CFGR_HPRE_DIV1;
    // RCC->CFGR |= RCC_CFGR_PPRE1_DIV1;
    // RCC->CFGR |= RCC_CFGR_PPRE2_DIV1;

    RCC->CFGR &= ~RCC_CFGR_SW;
    RCC->CFGR |= RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL) { /* Wait for switch */ }

    SystemCoreClockUpdate();
    SysTick_Config(SystemCoreClock / 1000U);
    
    RCC->APB2ENR |= (RCC_APB2ENR_IOPAEN | RCC_APB2ENR_SPI1EN | RCC_APB2ENR_USART1EN);
    RCC->APB1ENR |= (RCC_APB1ENR_TIM2EN | RCC_APB1ENR_TIM3EN);
}

void init_gpio(void)
{
    GPIOA->CRL &= ~(GPIO_CRL_MODE0 | GPIO_CRL_CNF0 | 
                    GPIO_CRL_MODE1 | GPIO_CRL_CNF1 |
                    GPIO_CRL_MODE2 | GPIO_CRL_CNF2 |
                    GPIO_CRL_MODE3 | GPIO_CRL_CNF3);
    GPIOA->CRL |= (GPIO_CRL_CNF0_1 | GPIO_CRL_CNF1_1 | 
                   GPIO_CRL_CNF2_1 | GPIO_CRL_CNF3_1);
    
    GPIOA->CRH &= ~(GPIO_CRH_MODE8 | GPIO_CRH_CNF8 |
                    GPIO_CRH_MODE11 | GPIO_CRH_CNF11 |
                    GPIO_CRH_MODE12 | GPIO_CRH_CNF12 |
                    GPIO_CRH_MODE13 | GPIO_CRH_CNF13 |
                    GPIO_CRH_MODE14 | GPIO_CRH_CNF14 |
                    GPIO_CRH_MODE15 | GPIO_CRH_CNF15);
    GPIOA->CRH |= (GPIO_CRH_CNF8_1 | GPIO_CRH_CNF11_1 |
                   GPIO_CRH_CNF12_1 | GPIO_CRH_CNF13_1 |
                   GPIO_CRH_CNF14_1 | GPIO_CRH_CNF15_1);
    
    GPIOA->ODR &= ~(BIT(0U) | BIT(1U) | BIT(2U) | BIT(3U) | BIT(8U) | 
                    BIT(11U) | BIT(12U) | BIT(13U) | BIT(14U) | BIT(15U));

    
    // PA4 (CS): Output, 2 MHz speed, push-pull
    GPIOA->CRL &= ~(GPIO_CRL_MODE4 | GPIO_CRL_CNF4);
    GPIOA->CRL |= GPIO_CRL_MODE4_1;  // 2MHz output
    GPIOA->ODR |= BIT(4U);  // Set CS high initially

