Arharim/STM32_LSM6DSO/src/MAIN.c
    // PA5 (SCK): AF push-pull, 2MHz
    GPIOA->CRL &= ~(GPIO_CRL_MODE5 | GPIO_CRL_CNF5);
    GPIOA->CRL |= (GPIO_CRL_MODE5_1 | GPIO_CRL_CNF5_1);

    // PA6 (MISO): Input floating (required for SPI)
    GPIOA->CRL &= ~(GPIO_CRL_MODE6 | GPIO_CRL_CNF6);
    GPIOA->CRL |= GPIO_CRL_CNF6_0;

    // PA7 (MOSI): AF push-pull, 2MHz
    GPIOA->CRL &= ~(GPIO_CRL_MODE7 | GPIO_CRL_CNF7);
    GPIOA->CRL |= (GPIO_CRL_MODE7_1 | GPIO_CRL_CNF7_1);

    // PA9 (TX): AF push-pull, 2MHz
    GPIOA->CRH &= ~(GPIO_CRH_MODE9 | GPIO_CRH_CNF9);
    GPIOA->CRH |= (GPIO_CRH_MODE9_1 | GPIO_CRH_CNF9_1);

    // PA10 (RX): Input floating (required for UART)
    GPIOA->CRH &= ~(GPIO_CRH_MODE10 | GPIO_CRH_CNF10);
    GPIOA->CRH |= GPIO_CRH_CNF10_0;

    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;
    GPIOB->CRL = 0x88888888UL;
    GPIOB->CRH = 0x88888888UL;
    GPIOB->ODR = 0x0000U;

    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;
    GPIOC->CRL = 0x88888888UL;
    GPIOC->CRH = 0x88888888UL;
    GPIOC->ODR = 0x0000U;
}

void init_spi(void)
{
    RCC->APB2RSTR |= RCC_APB2RSTR_SPI1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_SPI1RST;
    
    SPI1->CR1 &= ~SPI_CR1_SPE;
    
    SPI1->CR1 = 0UL;
    SPI1->CR1 |= SPI_CR1_MSTR;
    SPI1->CR1 |= SPI_CR1_BR_2;      // Baud rate: fPCLK/32 (~750kHz at 24MHz) - safer for LSM6DSO
    SPI1->CR1 |= SPI_CR1_CPOL;      // Clock polarity: idle high (Mode 3)
    SPI1->CR1 |= SPI_CR1_CPHA;      // Clock phase: capture on 2nd edge (Mode 3)
    SPI1->CR1 |= SPI_CR1_SSM;       // Software slave management
    SPI1->CR1 |= SPI_CR1_SSI;       // Internal slave select high
    
    SPI1->CR2 = 0UL;
    
    volatile u32 dummy = SPI1->DR;
    dummy = SPI1->SR;
    (void)dummy;
    
    SPI1->CR1 |= SPI_CR1_SPE;
    
    u32 timeout = 1000UL;
    while (((SPI1->CR1 & SPI_CR1_SPE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    
    CS_PIN_HIGH();
}

// Initialize UART1 for 115200 baud
void init_uart(void)
{
    RCC->APB2RSTR |= RCC_APB2RSTR_USART1RST;
    RCC->APB2RSTR &= ~RCC_APB2RSTR_USART1RST;
    
    USART1->CR1 &= ~USART_CR1_UE;
    
    USART1->BRR = UART_BRR;
    
    USART1->CR1 &= ~(USART_CR1_M | USART_CR1_PCE | USART_CR1_PS);
    
    USART1->CR2 &= ~USART_CR2_STOP;
    
    USART1->CR3 &= ~(USART_CR3_RTSE | USART_CR3_CTSE);
    
    USART1->SR = 0UL;
    
    USART1->CR1 &= ~(USART_CR1_RXNEIE | USART_CR1_TCIE | USART_CR1_TXEIE | 
                     USART_CR1_PEIE | USART_CR1_IDLEIE);
    
    USART1->CR1 |= (USART_CR1_TE | USART_CR1_RE);
    
    USART1->CR1 |= USART_CR1_UE;
    
    u32 timeout = 1000U;
    while (((USART1->SR & USART_SR_TC) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    
    const volatile u32 dummy_sr = USART1->SR;
    USART1->DR = UART_DUMMY_BYTE;
    (void)dummy_sr;
    
    NVIC_SetPriority(USART1_IRQn, 2U);
    NVIC_EnableIRQ(USART1_IRQn);
    
    if (((USART1->CR1 & USART_CR1_UE) == 0U) || 
        ((USART1->CR1 & USART_CR1_TE) == 0U) ||
        (USART1->BRR != UART_BRR)) {
        set_state(STATE_ERROR);
    }
}

// Initialize TIM2 for 100 Hz interrupts and TIM3 for delays
void init_timer(void)
{
    u32 timeout;
    u16 initial_count;

    RCC->APB1RSTR |= (RCC_APB1RSTR_TIM2RST | RCC_APB1RSTR_TIM3RST);
    RCC->APB1RSTR &= ~(RCC_APB1RSTR_TIM2RST | RCC_APB1RSTR_TIM3RST);
    
    for (volatile int i = 0; i < 100; i++) { __NOP(); }
    
    TIM2->CR1 = 0UL;
    TIM2->CR2 = 0UL;
    TIM2->SMCR = 0UL;
    TIM2->DIER = 0UL;
    TIM2->SR = 0UL;
    TIM2->CNT = 0UL;
    
    TIM2->PSC = TIM2_PSC;
    TIM2->ARR = TIM2_ARR;
    
    TIM2->EGR |= TIM_EGR_UG;
    
    TIM2->SR &= ~TIM_SR_UIF;
    
    TIM2->DIER |= TIM_DIER_UIE;
    
    NVIC_SetPriority(TIM2_IRQn, 3U);
    NVIC_EnableIRQ(TIM2_IRQn);
    
    TIM2->CR1 |= TIM_CR1_CEN;
    
    timeout = TIMER_CONFIG_TIMEOUT;
    initial_count = TIM2->CNT;
    while ((TIM2->CNT == initial_count) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) {
        const int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
                "ERR: TIM2 failed to start\r\n");
        if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
            uart_puts(g_format_buffer);
        }
        set_state(STATE_ERROR);
        return;
    }
    
    TIM3->CR1 = 0UL;
    TIM3->CR2 = 0UL;
    TIM3->SMCR = 0UL;
    TIM3->DIER = 0UL;
    TIM3->SR = 0UL;
    TIM3->CNT = 0UL;
    
    TIM3->PSC = TIM3_PSC;
    TIM3->ARR = TIM3_ARR;
    
    TIM3->EGR |= TIM_EGR_UG;
    
    TIM3->SR &= ~TIM_SR_UIF;
    
    TIM3->CR1 |= TIM_CR1_CEN;
    
    timeout = TIMER_CONFIG_TIMEOUT;
    initial_count = TIM3->CNT;
    while ((TIM3->CNT == initial_count) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) {
        const int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
                "ERR: TIM3 failed to start\r\n");
        if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
            uart_puts(g_format_buffer);
        }
        set_state(STATE_ERROR);
        return;
    }
    
    // Optional: Print timer configuration for debugging
    const u32 tim2_freq = SYSTEM_CLOCK_HZ / ((TIM2->PSC + 1UL) * (TIM2->ARR + 1UL));
    const u32 tim3_freq = SYSTEM_CLOCK_HZ / ((TIM3->PSC + 1UL) * (TIM3->ARR + 1UL));
    
    const int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
            "Timers OK: TIM2=%luHz TIM3=%luHz\r\n", tim2_freq, tim3_freq);
    if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
        uart_puts(g_format_buffer);
    }
}

// delay function using TIM3 (1 ms resolution, blocking) // use with caution !!!
void delay_ms(const u32 ms)
{
    u32 timeout;
    
    if (ms == 0U) {
        return;
    }
    
