Arharim/STM32_LSM6DSO/src/MAIN.c
    if (!is_timer_running((u32)TIM3)) {
        for (volatile u32 i = 0U; i < (ms * (SYSTEM_CLOCK_HZ / 1000UL)); i++) {
            __NOP();
        }
        return;
    }
    
    for (u32 i = 0U; i < ms; i++) {
        TIM3->CNT = 0UL;
        
        timeout = 10000U;
        while ((TIM3->CNT == 0U) && (timeout > 0U)) {
            timeout--;
            __NOP();
        }
        
        while ((TIM3->CNT < 1U) && (timeout > 0U)) {
            timeout--;
            __NOP();
        }
        
        if (timeout == 0U) {
            break;
        }
    }
}

// Non-blocking delay function using system tick
u8 delay_ms_nb(const u32 ms, u32 *const start_time)
{
    u8 delay_complete = 0U;
    
    if (start_time == NULL) {
        return 0U;
    }
    
    if (*start_time == 0U) {
        *start_time = get_system_tick();
    } else if ((get_system_tick() - *start_time) >= ms) {
        *start_time = 0U;
        delay_complete = 1U;
    } else {
        // Delay not complete
    }
    
    return delay_complete;
}

void get_timer_status(void)
{
    int snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
            "TIM2: EN=%d CNT=%u PSC=%u ARR=%u\r\n", 
            is_timer_running((u32)TIM2) ? 1 : 0,
            (unsigned int)TIM2->CNT, 
            (unsigned int)TIM2->PSC, 
            (unsigned int)TIM2->ARR);
    
    if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
        uart_puts(g_format_buffer);
    }
    
    snprintf_result = snprintf(g_format_buffer, sizeof(g_format_buffer), 
            "TIM3: EN=%d CNT=%u PSC=%u ARR=%u\r\n", 
            is_timer_running((u32)TIM3) ? 1 : 0,
            (unsigned int)TIM3->CNT, 
            (unsigned int)TIM3->PSC, 
            (unsigned int)TIM3->ARR);
    
    if ((snprintf_result > 0) && ((size_t)snprintf_result < sizeof(g_format_buffer))) {
        uart_puts(g_format_buffer);
    }
}

// Write a single byte via SPI with timeout
int spi_write(const u8 reg, const u8 data)
{
    u32 timeout;
    
    clear_spi_rx_buffer();
    
    CS_PIN_LOW();
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    SPI1->DR = (u16)reg;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    const volatile u8 dummy1 = (u8)SPI1->DR;
    (void)dummy1;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    SPI1->DR = (u16)data;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    const volatile u8 dummy2 = (u8)SPI1->DR;
    (void)dummy2;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_BSY) != 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    
    CS_PIN_HIGH();
    
    for (volatile int i = 0; i < DELAY_LOOP_COUNT; i++) { __NOP(); }
    
    return ERROR_NONE;
}

// Read a single byte via SPI with timeout
int spi_read(const u8 reg, u8* const data)
{
    u32 timeout;
    
    if (data == NULL) {
        return ERROR_INVALID_PARAM;
    }
    
    clear_spi_rx_buffer();
    
    CS_PIN_LOW();
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    SPI1->DR = (u16)(reg | 0x80U);
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    (void)SPI1->DR;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    SPI1->DR = (u16)SPI_DUMMY_BYTE;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    *data = (u8)SPI1->DR;
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_BSY) != 0U) && (timeout > 0U)) { 
        timeout--; 
    }
    
    CS_PIN_HIGH();
    
    for (volatile int i = 0; i < DELAY_LOOP_COUNT; i++) { __NOP(); }
    
    return ERROR_NONE;
}

// Read multiple bytes via SPI (burst mode) with timeout
int spi_read_burst(const u8 reg, u8* const buffer, const u8 len)
{
    u32 timeout;
    
    if ((buffer == NULL) || (len == 0U)) {
        return ERROR_INVALID_PARAM;
    }
    
    clear_spi_rx_buffer();
    
    CS_PIN_LOW();
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    SPI1->DR = (u16)(reg | 0x80U);
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    if (timeout == 0U) { 
        CS_PIN_HIGH(); 
        return ERROR_SPI_TIMEOUT; 
    }
    const volatile u8 dummy = (u8)SPI1->DR;
    (void)dummy;
    
    for (u8 i = 0U; i < len; i++) {
        timeout = SPI_UART_TIMEOUT;
        while (((SPI1->SR & SPI_SR_TXE) == 0U) && (timeout > 0U)) {
            timeout--;
            __NOP();
        }
        if (timeout == 0U) { 
            CS_PIN_HIGH(); 
            return ERROR_SPI_TIMEOUT; 
        }
        SPI1->DR = (u16)SPI_DUMMY_BYTE;
        
        timeout = SPI_UART_TIMEOUT;
        while (((SPI1->SR & SPI_SR_RXNE) == 0U) && (timeout > 0U)) {
            timeout--;
            __NOP();
        }
        if (timeout == 0U) { 
            CS_PIN_HIGH(); 
            return ERROR_SPI_TIMEOUT; 
        }
        buffer[i] = (u8)SPI1->DR;
    }
    
    timeout = SPI_UART_TIMEOUT;
    while (((SPI1->SR & SPI_SR_BSY) != 0U) && (timeout > 0U)) {
        timeout--;
        __NOP();
    }
    
    CS_PIN_HIGH();
    
    for (volatile int i = 0; i < DELAY_LOOP_COUNT; i++) {
        __NOP();
    }
    
    return ERROR_NONE;
}

// Send a string via UART using an interrupt-driven circular buffer (non-blocking)
void uart_puts(const char *const s)
{
    size_t chars_added = 0U;
    const char *str_ptr = s;
    
    if ((s == NULL) || !is_uart_enabled()) {
        return;
    }
    
    __disable_irq();
    
    while (*str_ptr != '\0') {
        const u16 next_idx = (g_uart_tx.write_idx + 1U) % UART_TX_BUFFER_SIZE;
        
        if (next_idx == g_uart_tx.read_idx) {
            break;
        }
        
        g_uart_tx.buffer[g_uart_tx.write_idx] = *str_ptr;
        g_uart_tx.write_idx = next_idx;
        str_ptr++;
        chars_added++;
    }
    
    if ((chars_added > 0U) && ((USART1->CR1 & USART_CR1_TXEIE) == 0U)) {
        USART1->CR1 |= USART_CR1_TXEIE;
    }
    
    __enable_irq();
}